[
  {
    "path": "posts/2025-07-16-waiotahefloodplainevolutionexercise/",
    "title": "Waiotahe Floodplain Evolution Exercise: Core Logging and Data Synthesis",
    "description": "This assignment was done for EARTHSCI 303: Sedimentary Systems. For this assignment we started with core logging of a specific core in Waitahe floodplain, and facies analysis of the core. Then using other cores and data, I was able to put together a synthesis for the possible evolution of the Waitahe floodplain.",
    "author": [
      {
        "name": "Nancy Huang",
        "url": {}
      }
    ],
    "date": "2025-07-20",
    "categories": [],
    "contents": "\nWelcome to my Waiotahe Floodplain Evolution Exercise that I completed as a part of EARTHSCI 303: Sedimentary Systems! The main focus of this exercise was to gain some experience with core logging, and paleoenvironmental analyses using logged cores and other subsurface data, including ground penetrating radar (GPR).\nThrough this exercise I was able to enhance and develop my core logging skills, looking specifically at changing grain sizes and changing sediments with depth, and looking at what this means in terms of its paleoenvironment. I was able to recognise changes from river channel to deep lake to floodplain. I was even able to piece together paleoseismic events, such as an earthquake event and paleotectonics of the area. This assignment provided me with a new way of interpreting and evaluating paleoenvironments and events that happened in the past, that shape the current landscape today.\nCore Logging\nFor the core logging, we were assigned a specific core in a particular location along the length of the floodplain, where we created a centimetre scale detailed log containing grain size, structure, contact, and other details such as colour and organics. We then provided detailed comments of the sediments origin, paleoenvironmental interpretation, compaction, and any other sedimentological details.\nFacies Diagram\nBased off our respective core, I constructed a facies diagram, whereby using the details of the core log, the facies with the changing sediments were interpreted. The facies analysis helped us realise the changes in paleoenvironments of the area, and we were able to analyse the shift in the main river channel, floodplain evolution, volcanic eruptions, and paleotectonic events.\n\nFence Diagram\nBased on every groups facies diagrams, we were able to match facies and create a fence diagram. The fence diagram allowed us to view the migration of certain facies types, and disappearances, piecing together the paleoenvironmental evolution of the general area.\n\nGround Penetrating Radar Image\nUsing the GPR image of the floodplain, we were able to see that there was a conjugate fault system in the area, and we found one specific core was from the middle of the conjugate fault, so I was able to directly analyse the vertical uplift and tectonic setting.\n\nTephra Identification\nUsing a microscope and tephra found in the cores, we were able to look at the mineral assemblage in particular tephras. By looking at the mineral assemblage in combination with its depth in the core, we were able to piece together the specific eruption the tephra came from, and therefore able to date the cores.\n\nTimescale and Final Interpretation\nFinally, using all the data collected from the cores, I put together a three-interval timescale of my interpretation of the evolution in the Waiotahe floodplain.\n\n• Initially, the area likely started out as the main river channel, which then eventually progressed into the floodplain as the channel migrated due to erosion/deposition (refer to Fig. 5., time-slice 1, and the lowermost facies in Fig. 1., 2., 3.)\n• The Whakatane eruption then occurred, ~5530 ybp (refer to Fig. 4.), where in certain areas tephra was preserved, particularly in the area where core 3_2025 was extracted (refer to Fig. 2.).\n• As subsidence occurred, likely with faulting/tectonics, a basin formed and was infilled with water, forming a lacustrine environment. This resulted in the deposition of fine-grained lake sediments, with vivianite presence, indicating the lacustrine environment. At the same time, the valley wall is defined by a series of interchanging organic/colluvium sediments as material is being brought in (refer to core 1_2018 in Fig. 2.)\n• An earthquake event then shook up the floodplain sands into the lake sediments (refer to sheet 6/7 in the core sheet description).\n• The lake shallowed with the presence of organic sediment, where the Taupo pumice alluvium was then washed in, possibly by the river, but as the lake dried out, the floodplain then migrated onto this area.\n• Potentially in between the lake and Taupo pumice alluvium, there was an influx of Taupo tephra, but it is unsure whether the reworked and the ~1717 ybp eruption from Fig 4. are the same.\n• With faulting, the floodplain was pushed up, and migrated eastward towards the valley wall, which occasionally would get an influx of colluvium, then return to floodplain (refer to Fig. 2. for core 1_2018, and Fig 3. for GPR image showing fault system).\n• The Kaharoa explosion then occurred, covering majority of the area with a layer of tephra (refer to Fig. 1., 2., 3. for where the lateral expanse of tephra).\n• Eventually we have come to present day, where the area is now still the floodplain, but the uppermost facies is now defined by a thin layer of modern topsoil (refer to Fig 1., 2., 3., 5., showing the vertical extent of topsoil).\n\n\n\n",
    "preview": {},
    "last_modified": "2025-07-20T17:37:56+12:00",
    "input_file": "waiotahefloodplainevolutionexercise.knit.md"
  },
  {
    "path": "posts/2025-07-05-geomorphic-mapping-geomorphic-impacts-of-extreme-weather-events/",
    "title": "Geomorphic Mapping: Geomorphic Impacts of Extreme Weather Events",
    "description": "This assignment was done for GEOG 262: Geomorphology. In this assignment we did some digital mapping of where landslide events were occurring in Golden Bay in the South Island after the 2011 storm event, and then some discussion on the impacts and responses to landsliding events.",
    "author": [
      {
        "name": "Nancy Huang",
        "url": {}
      }
    ],
    "date": "2025-07-16",
    "categories": [],
    "contents": "\nWelcome to my geomorphic mapping exercise that I did as part of GEOG 262: Geomorphology! In this assignment we looked at the effects of landsliding events as a result of the extreme 2011 storm, and the geomorphic impacts that the slips and storm had on the surface.\nThrough this assignment I gained some skills in digital mapping, particularly using Google Earth, using different tools like LiDAR imagery and looking at geomorphology at different timescales. The GEOG 262 course aided my competency in using Google Earth, and enhanced my mapping skills and recognition of geomorphic features. I was then able to use the map and GIS layers, in addition to other resources, to assess the landsliding risk in the area, and provide recommendations for mitigation and adaptation plans for the Golden Bay community.\nGeomorphic map\nI started off on Google Earth Pro with the area of interest (Mohua/Golden Bay), where I was able to explore some GIS layers including geology, DEM of difference, slope degree, and erosion risk index. Those layers helped me identify areas that have a high susceptibility for slips, especially with extreme weather events that are prone to cause flooding and stability issues. After construction of the geomorphic map, highlighting areas with slips, I found that the slides occurred along the areas geomorphically mapped as hillslopes, showing those were the areas of instability.\nDiscussion\nTo see discussion, please access through link.\nUsing the GIS layers on the map and the areas where landslides had been mapped, I was able to identify what the key controls were for landsliding, and following on that I then indicated what the future landslide risk for the area looks like.\nAfter that, I then investigated the downstream impacts of landsliding from extreme weather events on the Ligar Bay community, looking specifically at infrastructure, lifestyle, and economy, using media resources.\nFinally, I conducted some research on both the immediate and long-term impacts, and using that I then made some recommendations on what plans can be put in place, thinking specifically of the root causes of vulnerability, to reduce risk and better protect the community. Please refer to discussion for more on my findings from the map, impacts, and my recommendations to reduce risk to do with extreme weather impacts.\n\n\n\n",
    "preview": {},
    "last_modified": "2025-07-16T14:14:47+12:00",
    "input_file": "geomorphic-mapping-geomorphic-impacts-of-extreme-weather-events.knit.md"
  },
  {
    "path": "posts/2025-07-05-bree-creek-structural-geology-using-the-bree-creek-quadrangle/",
    "title": "Bree Creek: Structural Geology using the Bree Creek Quadrangle",
    "description": "This assignment was done for EARTHSCI 208: Earth Structure. This assignment is contains a series of practical structural geology work done only using a map with structural information, and then using the work done to create a report on the geology contained in the map.",
    "author": [
      {
        "name": "Nancy Huang",
        "url": {}
      }
    ],
    "date": "2025-07-09",
    "categories": [],
    "contents": "\nWelcome to my Bree Creek report that I did as part of EARTHSCI 208: Earth Structure! This assignment was based on all the practical structural geology work that we did throughout the course, based on the Bree Creek Quadrangle collating all the data together to write a professional report on the area.\nThe Bree Creek Report allowed me to engage on my structural geology skills, particularly in utilising the information on a map and projecting into the subsurface, and understanding tectonic influences on this fictional area. In this assignment I learnt how to construct a cross-section using a geologic map, create stereonets to discover the attributes of folding and faulting in the area, leading to an understanding in the tectonic history of the region. It then allowed me to hone in my report writing skills, where I constructed a report using the information retrieved in my practical work to describe the geological history portrayed in the map.\nIn the construction of the report, I learnt to write an abstract, create a table of contents, and how to structure a scientific report. This assignment was particularly solidified the direction I wanted to take in my Earth Science career in regards to a future in research.\n\n\n\n",
    "preview": {},
    "last_modified": "2025-07-09T10:45:45+12:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-07-05-measures-of-macroinvertebrate-community-index-and-nitrate-in-ecosystem-health/",
    "title": "Measures of Macroinvertebrate Community Index and Nitrate in Ecosystem Health",
    "description": "This assignment was done for ENVSCI 201: Natural and Human Environmental Systems. In this assignment we were asked to create an infographic and answer questions regarding the measures of macroinvertebrate community index (MCI) and nitrate for ecosystem health within freshwater bodies.",
    "author": [
      {
        "name": "Nancy Huang",
        "url": {}
      }
    ],
    "date": "2025-07-09",
    "categories": [],
    "contents": "\nWelcome to my ‘Freshwater’ assignment that I did as part of ENVSCI 201: Natural and Human Environmental Systems. The skills that I have gained through this assignment involve working with environmental data and looking at how environmental health is assessed and managed. I also took out some research, looking for peer-reviewed and grey literature where they discuss the scientific basis of nitrate and MCI measures of ecosystem health.\nIn the construction of the infographic we practiced manipulating environmental data and looked at how environmental health is managed in freshwater ecosystems. I was able to learn some excel functions in the creation of the two graphs, in order to visualise attribute bands based on MCI and nitrate, and discover if there is a correlation.\n\nThen we were provided with a series of three questions, where we had to carry out some research on peer-reviewed literature and grey literature to provide answers for the questions. For the first question, we were asked to look for material in the media, while the second question asked that we use peer-reviewed and grey literature. In the final question, I analysed the graphs created using the environmental data, and compared the effects of MCI and nitrate in assessing ecosystem health.\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-07-09T10:34:40+12:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-07-04-field-work-in-matheson-bay-mapping-lithological-boundaries-and-fossil-appearances/",
    "title": "Field Work in Matheson Bay: Mapping Lithological Boundaries and Fossil Appearances",
    "description": "This assignment was done for EARTHSCI 202: Earth History. For this assignment we did field work in Matheson Bay, mapping lithological boundaries, looking for fossil appearances, creating lithological descriptions and sedimentary logs. Using the data collected at Matheson Bay, a geological history was interpreted for the Matheson Bay area.",
    "author": [
      {
        "name": "Nancy Huang",
        "url": {}
      }
    ],
    "date": "2025-07-05",
    "categories": [],
    "contents": "\nWelcome to my Matheson Bay assignment that I did as part of EARTHSCI 202: Earth History! This assignment was a combination of field work and data analysis, where geological data was collected at Matheson Bay, and then used afterwards to develop a refined geological interpretation for the field site.\nThrough this assignment, I gained and developed my field work skills including sedimentological logging and geological mapping. I then refined my research skills by using field work data to create a summary of the area’s geological history.\nMaps; Field and Good\nWe started off in the field with a blank map, where we explored the geology of the area, looking at boundaries/contacts of lithologies and the appearances of fossil assemblages in each unit. We then mapped the position and boundaries of the six units, then mapped the fossil assemblages within each unit. In the field we also created sedimentological logs along the bay, documenting the thicknesses of units, fossil assemblages within units, and the type of contacts that separate the units.\n\nNext, using the base map done in the field, I was able to create a coloured, good copy of the map to use as reference in the geological interpretation. In this map the lithological contacts and fossil assemblages are highlighted, along with annotations that support field analyses.\n\nSedimentological Logs\nHere are the good copies of the sedimentological logs done at Matheson Bay. For the locations logging was done at, please refer to the good map. For the logs, we were asked to provide annotations for the units, describe the contacts of units, indicate maximum grain size of unit, and fossil assemblages.\n\n\n\n\n\nLithologic Descriptions\nIn the field, we took lithological descriptions of each unit that we saw, providing details of their composition, texture, colour, and other lithological details.\nWAIPAPA GROUP\nUnit A – Basement greywacke\n● Sedimentary\n● Muddy sandy composition\n● Dark grey in colour\n● Metamorphosed to an extent, deformed and fractured forming quartz veining\n● Fine grained, hard, strong, well sorted\nWAITEMATA GROUP, WARKWORTH SUBGROUP, CAPE RODNEY FORMATION\nUnit B – Lower greywacke breccia\n● Sedimentary\n● Clast supported, very coarse grained, uneven clasts, poorly sorted, fine grained matrix\n● Greywacke clasts; original source from Unit A – monomictic; clasts from just greywacke unit\nUnit C – Gravelly sandstone/sandy-gravelly conglomerate\n● Sedimentary\n● Uneven clasts, matrix supported, poorly sorted, medium to coarse grained\n● Polymictic; clasts contain greywacke, gravel, pebbles with a sandy matrix\n● Fossils; gastropods, bivalves, brachiopods, eagle ray-feeding burrows (trace), pink corals and algal pavements, flat barnacles, echinoderms – most fossiliferous unit; shallow water fauna, high energy environment, tropical warm environment\nUnit D – Upper greywacke breccia\n● Sedimentary\n● Clast supported, very coarse grained, uneven clasts, poorly sorted, fine grained shell matrix\n● Greywacke clasts; monomictic, original source Unit A\nUnit E – Sandy-gravelly limestone\n● Sedimentary\n● Limestone composition of calcium carbonate shells; main supply of sediment come from shells\n● Calcareous, moderately sorted, fine to coarse grained\n● Weathered and fractured along joints\n● Fossils; colonial reef corals, rhodoliths, acorn barnacles – tropical, warm, high energy environment\nWAITEMATA GROUP, WARKWORTH SUBGROUP, PAKIRI FORMATION\nUnit F – Interbedded sandstone and mudstone\n● Sedimentary\n● Mudstone; fine grained, well sorted, soft, light brown\n● Sandstone; well sorted, hard, quartz clasts, light brown and white,\n● Unweathered area\n● Authigenic mineral presence; glauconite, causing green colour change, indicating low sedimentation rates\n● Bluff forming material\n● Microfossils present in sediment; foraminifera – deep sea fossils ~1000m depth\nFinally, with the data collected and external references, I was able to compile a succinct geological history at Matheson Bay, discussing the tectonic evidence, changing depositional environments, paleoecology, and sea level changes.\nGeologic History of Mathesons Bay\nMathesons Bay is an area with a profound geological history, subject to seismic, tectonic, and sea level changes, with a distinct division between deep sea depositional environments and shallow depositional environments. Evidence of such events are explored through the various lithologies and by understanding the paleoenvironmental conditions.\nThe oldests rocks come from our basement greywacke (unit A), which we see on the northern end of the map, and reappearing as we head further southeast, making up the Waipapa Group. The greywacke sand layers were initially deposited by turbidity currents from sediments derived from the erosion and volcanic activity of Gondwana. Intense deformation via movements deep into the Earth’s crust where hot mineralised water is forced through the cracks in the greywacke, causing the quartz veins along various parts of the unit. This deformation causes the greywacke to have a heavily fractured appearance, particularly where it is exposed in the northern/north eastern ends of the shore platform (Morton, 1993). The eventual uplift and paleotopography has meant that the greywacke in certain areas is more elevated, and tends to disappear and reappear, like how it’s present in the northern end, then reappearing eastward on the map. A basal nondeposition unconformity throughout the early Miocene subsequent transgression created drowned valleys, steep cliffs, islands and sea stacks, somewhat resembling the modern coastline, which is what it would’ve looked like right up till the deposition of the Waitemata group (Ricketts., et al, 1989)\nThe next four depositions form the Cape Rodney formation in the Kawau Subgroup in the early Miocene, with the lower greywacke breccia being the oldest of the four (unit B). We only see it occurring in a small lens on the east of the shore platform, and only occurring at a topographic low because it gets eroded from the topographic highs of the basement, then being redeposited at decreased elevations. This is also why it is monomictic; the only source was that basement greywacke, so those clasts are all from the same source.\nThe sandstone/gravelly conglomerate (unit C) takes up a large portion of the southern shore platform of the bay, containing the bulk of the fossils. At this point water level has likely risen slightly, so energy is slightly lower, causing a change in grain size where the unit is more submerged, as seen in sediment log 3, as depth decreases so does grain size. We have similar depositional processes to unit B, so we see it occurring again at the topographic lows, forming an irregular contact between the two units. It continues to fill accommodation spaces driven by subsidence or potentially sea level rise, and eventually we start seeing lateral flats along the unit. Large, thick shelled oysters are found cemented to the rocks to suggest an exposed subtidal, shallow water environment (Eagle., et al, 1999), along with shell thickness implying potential predators for bivalve species. Barnacles often reside on hard substrates, which potentially could include the bivalve shells, which is present in this unit, also known as a transitional fossil. The presence of gastropods, rhodoliths, corals, and eagle ray feeding burrows indicate that the early Miocene saw a tropical climate, in order to support that type of fauna, due to their requirement for warmer temperatures and sunlight. Echinoderms can also be seen in this unit, suggesting an intertidal zone throughout this unit, which would make sense with the slight rise in water level.\nThe upper greywacke breccia (unit D), which is Auckland-wide, formed on the base of a large-scale seismic event, which sent large boulders of greywacke tumbling down, creating our greywacke clasts, which is also why we see it in lenses along the shore platform. The convergence boundary is also forming as a result of the formation of the subduction zone. Subduction began pulling Auckland down, forming the basin, increasing sea levels, and therefore creating accommodation space for our breccia to fill the space. We have a fine grained matrix which would’ve percolated into the spaces between clasts later on, with shell presence, implying a marine setting for the formation of the matrix.\nThe basin continues to subside, and we start seeing new material starting to fill up the space; we get a shell input as our main sediment supply, forming our sandy-gravelly limestone unit (unit E). Cliffs have likely retreated, meaning the greywacke source has been pushed back, leaving mainly shell sediments to fill the space. The limestone is much more significant along the north of the shore platform, but then only occurring in lenses along the south, which indicates the areas in which accommodation space was opening up for the influx of the shell sediment to fill.Once limestone forms, it becomes a very hard substrate, which is preferred for rhodoliths, acorn barnacles, bivalves, and coral colonies, which also imply a warmer, tropical climate following the formation of the limestone. Again, the thick-shelled bivalves and rhodolith presence indicate a high energy intertidal environment, with large influx of waves.\nSubsidence driven by subduction as a result of intensified convergence continued to pull Auckland down, causing a dramatic depth change of over 1000 metres. This is where we get our interbedded sandstones and mudstones (unit F), and by studying the microfossils known as foraminifera could we understand there was an intense depth change; foraminifera are a calcareous deep sea plankton that are only found in depths of at least 1000 metres. We get a colour change from green to brown, caused by an authigenic mineral, glauconite, at the boundary, which indicates an omission surface because we aren’t getting a large influx of sedimentation rates.\nWe get sporadic appearances of thin-shelled barnacles that require a hard substrate, likely coming from greywacke stacks, which can only be found at a depth of 400 metres, further indicating the rapid rate of subsidence and subduction along the Auckland area.\nReference list\n● Ballance. P. F. (1993). Geological History and Structure of the Auckland District. In J. E. Morton (Ed.), A Natural History of Auckland (pp. 4-11). David Bateman Ltd.\n● Eagle. M. K., Hayward. B. W., Grant-Mackie. J. A., Gregory. M. R. (1999). Fossil Communities in an Early Miocene Transgressive Sequence, Mathesons Bay, Leigh, Auckland. Department of Geology, University of Auckland.\n● Ricketts. B. D., Ballance. P. F., Hayward. B. W., Mayer. W. (1989). Basal Waitemata Group lithofacies: rapid subsidence in an early Miocene interarc basin, New Zealand. Sedimentology (pp. 559-580).\n\n\n\n",
    "preview": {},
    "last_modified": "2025-07-05T18:18:25+12:00",
    "input_file": {}
  }
]
